# IS 362 - Project 1
Sunah Lee
### Compare the arrival delays for two airlines across five destinations

## Part 1: Create a .CSV file with the information given

I created a new CSV file names IS362_Project1_SunahLee and reorganized the data.
The Airlines and on time and delayed counts were reorganized into columns and the cities were reorganized into rows.
This was done to easily manipulate the columns and add more columns if necessary.

In [90]:
import pandas as pd

In [91]:
airlines = pd.read_csv('IS362_Project1_SunahLee.csv')
airlines

            City  ALASKA_ontime  ALASKA_delayed  AMWEST_ontime  AMWEST_delayed
0    Los Angeles            497              62            694             117
1        Phoenix            221              12           4840             415
2      San Diego            212              20            383              65
3  San Francisco            503             102            320             129
4        Seattle           1841             305            201              61

## Part 2: Perform analysis to compare the arrival delays for the two airlines
To compare the arrival delays of the two airlines, I inserted new columns in column 3 and 6 to show the total number of flights for each airline.

In [92]:
copy = airlines.copy()
copy.insert(3, 'ALASKA_total', airlines.ALASKA_ontime + airlines.ALASKA_delayed)
copy.insert(6, 'AMWEST_total', airlines.AMWEST_ontime + airlines.AMWEST_delayed)
copy

,City,ALASKA_ontime,ALASKA_delayed,ALASKA_total,AMWEST_ontime,AMWEST_delayed,AMWEST_total
0,Los Angeles,497,62,559,694,117,811
1,Phoenix,221,12,233,4840,415,5255
2,San Diego,212,20,232,383,65,448
3,San Francisco,503,102,605,320,129,449
4,Seattle,1841,305,2146,201,61,262

The total number of flights for the airlines were significantly different depending on the cities. Therefore, it is inaccurate to analyze the delays based on the number of delays.
Therefore, the percentage of delayes were calculated as below.

In [93]:
copy2 = copy.copy()
copy2.insert(1, 'ALASKA_delayrate', copy.ALASKA_delayed / (copy.ALASKA_delayed + copy.ALASKA_ontime))
copy2.insert(2, 'AMWEST_delayrate', copy.AMWEST_delayed / (copy.AMWEST_delayed + copy.AMWEST_ontime))
copy2[['City', 'ALASKA_delayrate', 'AMWEST_delayrate']]

            City  ALASKA_delayrate  AMWEST_delayrate
0    Los Angeles          0.110912          0.144266
1        Phoenix          0.051502          0.078972
2      San Diego          0.086207          0.145089
3  San Francisco          0.168595          0.287305
4        Seattle          0.142125          0.232824

The delay rates for AMWEST airline was higher than for ALASKA airline across all five cities.
The average delay rate for ALASKA airline was 11.19% as calculated below.

In [94]:
copy2['ALASKA_delayrate'].mean()

0.11186826215429235

The average delay rate for AMWEST airline was 17.77% as calculated below.

In [95]:
copy2['AMWEST_delayrate'].mean()

0.17769151615506856

## Conclusion
AMWEST airline's average arrival delay rate (which was 17.77%) is 6.58% higher than ALASKA airline's average arrival delay rate(which was 11.19%).
Therefore, ALASKA airline is the better choice when comparing the two airlines solely based on arrival delay rates.